---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsActualNumberOfRisers
source: html/ccdab426-5b29-6fb8-8f11-bd2102eff093.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsActualNumberOfRisers Property

"Actual Number of Risers": The total number of actually created risers in model

## Syntax (C#)
```csharp
public static ForgeTypeId StairsActualNumberOfRisers { get; }
```